socialNetwork/results/scaling-on-bench1.5-may6/benchmark1.5-05-06-26_145100/istio/1000.txt
Running 2m test @ http://128.105.146.159:80
  16 threads and 128 connections

  Thread calibration: mean lat.: 5010.085ms, rate sampling interval: 13852ms
  Thread calibration: mean lat.: 5446.278ms, rate sampling interval: 14860ms
  Thread calibration: mean lat.: 5217.482ms, rate sampling interval: 14295ms
  Thread calibration: mean lat.: 5058.556ms, rate sampling interval: 14032ms
  Thread calibration: mean lat.: 5284.744ms, rate sampling interval: 14835ms
  Thread calibration: mean lat.: 5359.999ms, rate sampling interval: 14721ms
  Thread calibration: mean lat.: 5223.262ms, rate sampling interval: 14213ms
  Thread calibration: mean lat.: 4992.150ms, rate sampling interval: 13828ms
  Thread calibration: mean lat.: 5215.139ms, rate sampling interval: 14409ms
  Thread calibration: mean lat.: 5217.035ms, rate sampling interval: 14417ms
  Thread calibration: mean lat.: 5397.931ms, rate sampling interval: 14630ms
  Thread calibration: mean lat.: 5217.454ms, rate sampling interval: 14376ms
  Thread calibration: mean lat.: 5257.399ms, rate sampling interval: 14360ms
  Thread calibration: mean lat.: 5044.829ms, rate sampling interval: 14041ms
  Thread calibration: mean lat.: 5178.584ms, rate sampling interval: 14368ms
  Thread calibration: mean lat.: 5101.267ms, rate sampling interval: 13893ms
reconnect_socket
reconnect_socket
reconnect_socket
[...]

-----------------------------------------------------------------------
Test Results @ http://128.105.146.159:80 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.30s     6.97s   19.82s    75.66%
    Req/Sec    65.90     22.19   114.00     69.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.65s 
 75.000%   13.08s 
 90.000%   16.77s 
 99.000%   19.82s 
 99.900%   21.09s 
 99.990%   21.73s 
 99.999%   21.94s 
100.000%   22.15s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      11.079     0.000000            1         1.00
      14.295     0.100000        11617         1.11
      15.623     0.200000        23254         1.25
      17.615     0.300000        34857         1.43
      23.887     0.400000        46439         1.67
    2654.207     0.500000        58048         2.00
    5685.247     0.550000        63858         2.22
    8024.063     0.600000        69657         2.50
    9846.783     0.650000        75486         2.86
   11476.991     0.700000        81268         3.33
   13082.623     0.750000        87092         4.00
   13778.943     0.775000        89971         4.44
   14499.839     0.800000        92892         5.00
   15065.087     0.825000        95794         5.71
   15622.143     0.850000        98700         6.67
   16162.815     0.875000       101610         8.00
   16457.727     0.887500       103071         8.89
   16769.023     0.900000       104511        10.00
   17088.511     0.912500       105978        11.43
   17416.191     0.925000       107414        13.33
   17793.023     0.937500       108885        16.00
   17973.247     0.943750       109595        17.78
   18169.855     0.950000       110314        20.00
   18366.463     0.956250       111060        22.86
   18546.687     0.962500       111750        26.67
   18776.063     0.968750       112478        32.00
   18907.135     0.971875       112855        35.56
   19038.207     0.975000       113192        40.00
   19185.663     0.978125       113576        45.71
   19316.735     0.981250       113920        53.33
   19480.575     0.984375       114302        64.00
   19562.495     0.985938       114465        71.11
   19644.415     0.987500       114640        80.00
   19742.719     0.989062       114822        91.43
   19873.791     0.990625       115012       106.67
   20037.631     0.992188       115203       128.00
   20119.551     0.992969       115286       142.22
   20185.087     0.993750       115379       160.00
   20283.391     0.994531       115475       182.86
   20365.311     0.995313       115555       213.33
   20447.231     0.996094       115641       256.00
   20512.767     0.996484       115692       284.44
   20561.919     0.996875       115737       320.00
   20611.071     0.997266       115777       365.71
   20676.607     0.997656       115819       426.67
   20791.295     0.998047       115868       512.00
   20840.447     0.998242       115889       568.89
   20905.983     0.998437       115911       640.00
   20987.903     0.998633       115942       731.43
   21037.055     0.998828       115959       853.33
   21086.207     0.999023       115979      1024.00
   21135.359     0.999121       115990      1137.78
   21168.127     0.999219       116001      1280.00
   21233.663     0.999316       116016      1462.86
   21282.815     0.999414       116024      1706.67
   21364.735     0.999512       116036      2048.00
   21381.119     0.999561       116040      2275.56
   21413.887     0.999609       116049      2560.00
   21430.271     0.999658       116052      2925.71
   21479.423     0.999707       116057      3413.33
   21528.575     0.999756       116066      4096.00
   21528.575     0.999780       116066      4551.11
   21561.343     0.999805       116069      5120.00
   21626.879     0.999829       116072      5851.43
   21659.647     0.999854       116075      6826.67
   21708.799     0.999878       116078      8192.00
   21725.183     0.999890       116079      9102.22
   21741.567     0.999902       116080     10240.00
   21757.951     0.999915       116082     11702.86
   21807.103     0.999927       116083     13653.33
   21839.871     0.999939       116084     16384.00
   21856.255     0.999945       116087     18204.44
   21856.255     0.999951       116087     20480.00
   21856.255     0.999957       116087     23405.71
   21856.255     0.999963       116087     27306.67
   21905.407     0.999969       116088     32768.00
   21905.407     0.999973       116088     36408.89
   21921.791     0.999976       116089     40960.00
   21921.791     0.999979       116089     46811.43
   21921.791     0.999982       116089     54613.33
   21938.175     0.999985       116090     65536.00
   21938.175     0.999986       116090     72817.78
   21938.175     0.999988       116090     81920.00
   21938.175     0.999989       116090     93622.86
   21938.175     0.999991       116090    109226.67
   22151.167     0.999992       116091    131072.00
   22151.167     1.000000       116091          inf
#[Mean    =     6295.873, StdDeviation   =     6974.965]
#[Max     =    22134.784, Total count    =       116091]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  118607 requests in 2.00m, 1.68GB read
  Socket errors: connect 0, read 4, write 0, timeout 0
Requests/sec:    988.47  
Transfer/sec:     14.37MB